// Задача на нахождение максимального из 2 чисел
int a = -9;
int b = -3;
int max = a;
if (a > max) max = a;
if (b > max) max = b;
Console.WriteLine(max);