// Задача 3 - нахождение четного нечетного. Если абсолютно то же самое ввожу копированием из других источников 
// то ошибок не выдает. Помогите, что мне с этим делать???
int a = 8;
if (a % 2 == 0);
{
    Console.WriteLine("Число четное");
}
else
{
    Console.WriteLine("Число нечетное");
}




// просто вставленное из другого источника но работает. почему так, Помогите. Все что толком не ввожу не идет
int a = 5;
if (a % 2 == 0)
{
	Console.WriteLine("Число четное");
}
else
{
	Console.WriteLine("Число нечетное");
}
// Таким образом моя написанная не идет , то else не то, то ; не нравятся , а тупо загруженная работает. 
// 4 задачу не птшу здесь, т к не вижу смысла. Алгоритм понимаю.